<template>
  <div max-width="1000">
    <h2>Тестовое задание для кандидата на вакансию фронтенд разработчика</h2>
    <p>Необходимо реализовать работу с контактами на Vue.js:</p>
    <ol>
      <li>
        Инициализировать список контактов случайным образом, к примеру,
        комбинации имен и фамилий (штук 100 для пагинации).
      </li>
      <li>
        Добавление/редактирование/удаление контактов.
        <strong>ID, ФИО, дата рождения.</strong>
      </li>
      <li>
        Страница поиска, список сотрудников. Не забываем про пагинацию. Поиск
        срабатывает после введения от 3-х символов.
      </li>
      <li>
        Страница профиля контакта + диалоговое всплывающее для предпросмотра на
        главной странице.
      </li>
      <li>
        Страница добавления + диалоговое всплывающее для главной страницы.
      </li>
    </ol>
    <p>Можно использовать любой UI фреймворк: Bootstrap, Vuetify или прочий.</p>
    <p>
      Постараться раскрыть возможности библиотеки (компоненты, асинхронность,
      TypeScript).
    </p>
    <p>
      Ожидаем от Вас ссылку на репозиторий (желательно, чтобы каждый новый
      функционал был отдельно закоммичен) и сопроводительное сообщение с
      инструкцией по развертыванию проекта.
    </p>
    <p>
      Разработал: Макеев Алексей Борисович, makeevhome@mail.ru, +7(918)
      088-46-88
    </p>
    <div class="d-flex justify-center">
      <VBtn class="mx-auto my-10" to="/">На главную</VBtn>
    </div>
  </div>
</template>

<script setup lang="ts"></script>

<style scoped>
div {
  font-family: Arial, sans-serif;
  line-height: 1.6;
  margin: auto;
  background-color: #f9f9f9;
  color: #333;
  width: 1000px;
}
h1 {
  color: #2c3e50;
}
h2 {
  color: #34495e;
  margin-top: 20px;
}
p {
  margin: 10px 0;
}
ol {
  margin: 10px 0;
  text-indent: 15px;
  margin-left: 40px;
}
li {
  margin: 5px 0;
}
</style>
